NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
/*******************************************************************************
 * Helper Functions // Mocks // Callbacks
 *******************************************************************************/
static void print_configuration(void)
{
    printf("Device: \n");

    access_model_handle_t models[ACCESS_MODEL_COUNT];
    access_model_id_t model_id;
    uint16_t model_count;
    for (unsigned i = 0; i < ACCESS_ELEMENT_COUNT; ++i)
    {
        printf("\tElement %u: %u\n", i, i + ELEMENT_ADDRESS_START);

        model_count = ACCESS_MODEL_COUNT;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(i, models, &model_count));
        for (unsigned j = 0; j < model_count; j++)
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_id_get(models[j], &model_id));
            printf("\t\tModel %u:0x%04X:0x%04X \n", j, model_id.model_id, model_id.company_id);

            printf("\t\t\tOpcodes: {");
            for (unsigned k = 0; k < OPCODE_COUNT - 1; ++k)
            {
                printf(" 0x%04x,", m_opcode_handlers[models[j]][k].opcode.opcode);
            }
            printf(" 0x%04x }\n", m_opcode_handlers[models[j]][OPCODE_COUNT-1].opcode.opcode);
        }
    }
}

timestamp_t timer_now(void)
{
    return 0;
}

static access_model_handle_t init_test_model_and_subs_list(access_flash_test_struct_t * p_test_data)
{
    access_model_handle_t model_handle;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&p_test_data->add_params, &model_handle));

    if (p_test_data->subscription_list_share_index == UINT32_MAX)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(model_handle));
    }
    else
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(p_test_data->subscription_list_share_index, model_handle));
    }
    return model_handle;
}

static void update_test_model(access_flash_test_struct_t * p_test_data, access_model_handle_t model_handle, bool expect_publish_period_set)
{
    for (uint32_t subs = 0; subs < p_test_data->number_of_subscription_handles; ++subs)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(model_handle, p_test_data->p_subsciption_address_handles[subs]));
    }
    for (uint32_t apps = 0; apps < p_test_data->number_of_appkey_handles; ++apps)
    {
         TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(model_handle, p_test_data->p_appkey_handles[apps]));
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_set(model_handle, p_test_data->publish_address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_set(model_handle, p_test_data->publish_ttl));
    if (expect_publish_period_set)
    {
        access_publish_period_set_Expect(NULL, (access_publish_resolution_t) p_test_data->publish_period.step_res, p_test_data->publish_period.step_num);
        access_publish_period_set_IgnoreArg_p_pubstate();
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_set(model_handle, (access_publish_resolution_t) p_test_data->publish_period.step_res,
        p_test_data->publish_period.step_num));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_set(model_handle, p_test_data->publish_appkey_handle));
}

#define VAL_IN_ARRAY(VAL, ARR, ARR_SIZE, FOUND) \
                                        do {\
                                            FOUND = false;\
                                            for (uint32_t __IDX = 0; __IDX < ARR_SIZE; ++__IDX)\
                                            {\
                                                if (ARR[__IDX] == VAL)\
                                                {\
                                                    FOUND = true;\
                                                    break;\
                                                }\
                                            }\
                                        } while (0)

static void verify_test_case_and_access_state(access_flash_test_struct_t * p_test_input, access_model_handle_t model_handle)
{
    access_model_id_t model_id;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_id_get(model_handle, &model_id));
    TEST_ASSERT_EQUAL_UINT8_ARRAY(&p_test_input->add_params.model_id, &model_id, sizeof(model_id));
    dsm_handle_t dsm_handle;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_application_get(model_handle, &dsm_handle));
    TEST_ASSERT_EQUAL(p_test_input->publish_appkey_handle, dsm_handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_get(model_handle, &dsm_handle));
    TEST_ASSERT_EQUAL(p_test_input->publish_address_handle, dsm_handle);
    dsm_handle_t appkey_handles[DSM_APP_MAX];
    uint16_t appkey_count = DSM_APP_MAX;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_applications_get(model_handle, appkey_handles, &appkey_count));
    for (uint32_t appkey_idx = 0; appkey_idx < p_test_input->number_of_appkey_handles; ++appkey_idx)
    {
        TEST_ASSERT_EQUAL(p_test_input->p_appkey_handles[appkey_idx], appkey_handles[appkey_idx]);
    }
    access_model_handle_t model_handles[ACCESS_MODEL_COUNT];
    uint16_t models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(p_test_input->add_params.element_index, model_handles, &models_count));
    bool model_exists = false;
    VAL_IN_ARRAY(model_handle, model_handles, models_count, model_exists);
    TEST_ASSERT_TRUE(model_exists);
    dsm_handle_t subs_handles[DSM_ADDR_MAX];
    uint16_t subs_count = DSM_ADDR_MAX;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscriptions_get(model_handle, subs_handles, &subs_count));
    for (uint32_t i = 0; i < p_test_input->number_of_subscription_handles; ++i)
    {
        bool addr_exists;
        VAL_IN_ARRAY(p_test_input->p_subsciption_address_handles[i], subs_handles, subs_count, addr_exists);
        TEST_ASSERT_TRUE(addr_exists);
    }
    uint8_t ttl;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_ttl_get(model_handle, &ttl));
    TEST_ASSERT_EQUAL(p_test_input->publish_ttl, ttl);
    access_publish_resolution_t resolution = (access_publish_resolution_t) p_test_input->publish_period.step_res;
    uint8_t step_number = p_test_input->publish_period.step_num;
    access_publish_period_get_Expect(NULL, &resolution, &step_number);
    access_publish_period_get_IgnoreArg_p_pubstate();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_period_get(model_handle, &resolution, &step_number));
    TEST_ASSERT_EQUAL(p_test_input->publish_period.step_res, resolution);
    TEST_ASSERT_EQUAL(p_test_input->publish_period.step_num, step_number);
}

static void verify_flash_modeldata(access_flash_test_struct_t * p_test_input, access_model_state_data_t * p_model_data, uint16_t subs_pool_index)
{
    TEST_ASSERT_EQUAL_UINT8_ARRAY(&p_test_input->add_params.model_id, &p_model_data->model_id, sizeof(p_model_data->model_id));
    TEST_ASSERT_EQUAL(p_test_input->publish_appkey_handle, p_model_data->publish_appkey_handle);
    TEST_ASSERT_EQUAL(p_test_input->publish_address_handle, p_model_data->publish_address_handle);
    for (uint32_t appkey_idx = 0; appkey_idx < p_test_input->number_of_appkey_handles; ++appkey_idx)
    {
        TEST_ASSERT_TRUE(bitfield_get(p_model_data->application_keys_bitfield, p_test_input->p_appkey_handles[appkey_idx]));
    }
    TEST_ASSERT_EQUAL(p_test_input->add_params.element_index, p_model_data->element_index);
    TEST_ASSERT_EQUAL(subs_pool_index, p_model_data->subscription_pool_index);
    TEST_ASSERT_EQUAL(p_test_input->publish_ttl, p_model_data->publish_ttl);
    TEST_ASSERT_EQUAL_UINT8_ARRAY(&p_test_input->publish_period, &p_model_data->publication_period, sizeof(p_test_input->publish_period));
}


static fm_entry_t * expect_flash_manager_entry(fm_handle_t handle, uint32_t data_length)
{
    static uint8_t buffer[UINT16_MAX+1];
    static uint16_t buffer_index = 0;
    fm_entry_t * p_entry = (fm_entry_t *) &buffer[buffer_index];
    buffer_index += ALIGN_VAL((sizeof(fm_entry_t) + data_length), 4);
    flash_manager_entry_alloc_ExpectAndReturn(mp_flash_manager, handle, data_length, p_entry);
    flash_manager_entry_commit_Expect(p_entry);
    p_entry->header.handle = handle;
    return p_entry;
}

static void restore_flash(fm_handle_filter_t * p_filter, fm_entry_t ** p_expected_entries, uint32_t no_entries)
{
    flash_manager_entry_next_get_ExpectWithArrayAndReturn(mp_flash_manager, 1, p_filter, 1, NULL, 1, p_expected_entries[0]);
    for (uint32_t i = 1; i < no_entries; ++i)
    {
        flash_manager_entry_next_get_ExpectWithArrayAndReturn(mp_flash_manager, 1, p_filter, 1, p_expected_entries[i-1], 1, p_expected_entries[i]);
    }
    flash_manager_entry_next_get_ExpectWithArrayAndReturn(mp_flash_manager, 1, p_filter, 1, p_expected_entries[no_entries-1], 1, NULL);

