NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    // still expect a TX, as the loopback doesn't prevent it when sending to a group address:
    const uint8_t raw_packet_data[] = "\x00loopback";
    expect_tx(raw_packet_data, data_length + 1 /* opcode */, ELEMENT_ADDRESS_START, m_addresses[address_handle].value, 0, DSM_HANDLE_INVALID);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(0, &message));

    dsm_address_is_rx_ExpectAndReturn(&m_addresses[address_handle], true); // called again in the bearer cb, as we created a loopback context.
    expect_msg(opcode, (uint32_t) TEST_REFERENCE, data, data_length);
    m_bearer_cb();
}

void test_virtual_loopback(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    const uint8_t data[] = "loopback";
    const uint16_t data_length = strlen((const char *) data);
    dsm_handle_t address_handle = ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT + 1;

    /* Replace the current address in the address array with a virtual address: */
    const uint8_t label_uuid[] = { 0xf4, 0xa0, 0x02, 0xc7, 0xfb, 0x1e, 0x4c, 0xa0, 0xa4, 0x69, 0xa0, 0x21, 0xde, 0x0d, 0xb8, 0x75 };
    m_addresses[address_handle].type = NRF_MESH_ADDRESS_TYPE_VIRTUAL;
    m_addresses[address_handle].value = 0x9736;
    m_addresses[address_handle].p_virtual_uuid = label_uuid;

    /* Set publish address handle to 0 and subscribe to it: */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish_address_set(0, address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(0, address_handle));

    access_message_tx_t message =
    {
        .opcode = opcode, /*lint !e64 Type mismatch */
        .p_buffer = data,
        .length = data_length
    };

    dsm_address_get_StubWithCallback(address_get_stub);

    dsm_address_handle_get_ExpectAnyArgsAndReturn(NRF_SUCCESS);
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&address_handle);

    bearer_event_flag_set_Expect(ACCESS_LOOPBACK_FLAG);
    dsm_address_is_rx_ExpectAndReturn(&m_addresses[address_handle], true); // accept loopback

    // still expect a TX, as the loopback doesn't prevent it when sending to a group address:
    const uint8_t raw_packet_data[] = "\x00loopback";
    expect_tx(raw_packet_data, data_length + 1 /* opcode */, ELEMENT_ADDRESS_START, m_addresses[address_handle].value, 0, DSM_HANDLE_INVALID);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(0, &message));

    dsm_address_is_rx_ExpectAndReturn(&m_addresses[address_handle], true); // called again in the bearer cb, as we created a loopback context.
    expect_msg(opcode, (uint32_t) TEST_REFERENCE, data, data_length);
    m_bearer_cb();
}

void test_key_access(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    uint8_t data[] = "Hello, World!";
    uint16_t data_length = sizeof(data);

    /* Sanity check that we can receive a message for key index 0. */
    expect_msg(opcode, (uint32_t) TEST_REFERENCE, data, data_length);
    access_reliable_message_rx_cb_Expect(0, NULL, TEST_REFERENCE);
    access_reliable_message_rx_cb_IgnoreArg_p_message();
    /* TODO: CMock tries to compare the location where p_args points to :( */
    access_reliable_message_rx_cb_IgnoreArg_p_args();
    send_msg(opcode, data, data_length, 0, 0);

    /* Check that we don't receive a message that we don't have the application key for. */
    for (unsigned i = 1; i < DSM_APP_MAX; ++i)
    {
        send_msg(opcode, data, data_length, 0, i);
    }
}

void test_group_addressing(void)
{
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);
    /* Let the two last models share their lists. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_lists_share(ACCESS_MODEL_COUNT-2, ACCESS_MODEL_COUNT-1));

    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    uint8_t data[] = "Hello, World!";
    uint16_t data_length = sizeof(data);

    /* Add the same subscription for every model instance. */
    const uint32_t MODELS_PER_ELEMENT = ((ACCESS_MODEL_COUNT + ACCESS_ELEMENT_COUNT - 1)/ACCESS_ELEMENT_COUNT);
    for (uint32_t i = 0; i < ACCESS_ELEMENT_COUNT; ++i)
    {
        for (uint32_t j = 0; j < MODELS_PER_ELEMENT; ++j)
        {
            access_model_handle_t handle = i*MODELS_PER_ELEMENT + j;
            TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(handle, ACCESS_ELEMENT_COUNT + j));
        }
    }

    for (uint32_t i = 0; i < MODELS_PER_ELEMENT; ++i)
    {
        opcode.opcode = i*OPCODE_COUNT;
        for (uint32_t j = 0; j < ACCESS_ELEMENT_COUNT; j++)
        {
            /* Expect one message for each of the elements. */
            expect_msg(opcode, (uint32_t) ((uint32_t *)TEST_REFERENCE + j*MODELS_PER_ELEMENT + i), data, data_length);
        }
        send_msg(opcode, data, data_length, ACCESS_ELEMENT_COUNT + i, 0);
    }
}

void test_model_publish(void)
{
    access_message_tx_t message;
    const uint8_t data[] = "Hello, World";
    const access_opcode_t opcodes[] = { ACCESS_OPCODE_SIG(0x0040), ACCESS_OPCODE_SIG(0x8123), ACCESS_OPCODE_VENDOR(0x0c0, 0x1337) };
    const unsigned num_opcodes = ARRAY_SIZE(opcodes);
    message.opcode.opcode = opcodes[0].opcode;
    message.opcode.company_id =opcodes[0].company_id;
    message.p_buffer = data;
    message.length = sizeof(data);
    message.force_segmented = false;
    message.transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT;

    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish(ACCESS_MODEL_COUNT, &message));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish(0, &message));
    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    message.length = ACCESS_MESSAGE_LENGTH_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_publish(0, &message));
    message.length = sizeof(data);
    message.opcode.opcode = 0x7f;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish(0, &message));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish(0, &message));

    for (uint32_t i = 0; i < ACCESS_MODEL_COUNT; ++i)
    {
        message.opcode.opcode = opcodes[i % num_opcodes].opcode;
        message.opcode.company_id =opcodes[i % num_opcodes].company_id;
        message.p_buffer = data;
        message.length = sizeof(data);

