NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
        uint16_t src = ELEMENT_ADDRESS_START + i * ACCESS_ELEMENT_COUNT / ACCESS_MODEL_COUNT;
        uint16_t dst = PUBLISH_ADDRESS_START + i;

        uint8_t expected_data[sizeof(data) + sizeof(uint32_t)];
        uint32_t length = opcode_raw_write(message.opcode, expected_data);
        memcpy(&expected_data[length], data, message.length);
        length += message.length;
        nrf_mesh_address_t dst_addr = {NRF_MESH_ADDRESS_TYPE_UNICAST, dst};
        dsm_address_is_rx_ExpectAndReturn(&dst_addr, false); // don't want loopback
        expect_tx(expected_data, length, src, dst, 0, DSM_HANDLE_INVALID);

        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_publish(i, &message));
    }
}

void test_error_conditions(void)
{
    /* Not initialized */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_set(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_set(0, (access_publish_resolution_t) 0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_remove(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_bind(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_unbind(0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_set(0, 0));

    build_device_setup(ACCESS_ELEMENT_COUNT, ACCESS_MODEL_COUNT);

    /* Out of bounds */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_set(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_set(ACCESS_MODEL_COUNT, (access_publish_resolution_t) 0, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_remove(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_bind(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_unbind(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_set(ACCESS_MODEL_COUNT, 0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_location_set(ACCESS_ELEMENT_COUNT, 0));

    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_address_set(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_subscription_add(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_subscription_remove(0, DSM_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_application_bind(0, DSM_APP_MAX + DSM_DEVICE_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_application_unbind(0, DSM_APP_MAX + DSM_DEVICE_MAX));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_publish_application_set(0, DSM_APP_MAX + DSM_DEVICE_MAX));

    /* Unknown event shouldn't do anything. */
    nrf_mesh_evt_t evt;
    evt.type = NRF_MESH_EVT_IV_UPDATE_NOTIFICATION;
    mp_evt_handler->evt_cb(&evt);

    /* Publishing with no mem should give an error. */
    access_message_tx_t tx_message = {};
    access_message_rx_t rx_message = {};
    tx_message.length = 0;
    tx_message.opcode.opcode = 0x00;
    tx_message.opcode.company_id = ACCESS_COMPANY_ID_NONE;

    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_reply(0, NULL, &tx_message));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_reply(0, &rx_message, NULL));
    tx_message.length = ACCESS_MESSAGE_LENGTH_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_model_reply(0,&rx_message, &tx_message));
    tx_message.length = 0;
    tx_message.opcode.opcode = 0xFFFF;
    tx_message.opcode.company_id = 0x1337;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, access_model_reply(0,&rx_message, &tx_message));

    const dsm_handle_t ADDRESS_COUNT = ACCESS_ELEMENT_COUNT + ACCESS_MODEL_COUNT + SUBSCRIPTION_ADDRESS_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_add(0, ADDRESS_COUNT-1));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(0, DSM_APP_MAX + DSM_DEVICE_MAX-1));

    /* Sanity checking. */
    const uint8_t data[] = "Test Data";
    access_opcode_t opcode = ACCESS_OPCODE_SIG(0);
    expect_msg(opcode, (uint32_t) TEST_REFERENCE, data, sizeof(data));

    send_msg(opcode, data, sizeof(data), ADDRESS_COUNT-1, DSM_APP_MAX + DSM_DEVICE_MAX-1);

    /* Send with wrong key. */
    send_msg(opcode, data, sizeof(data), ADDRESS_COUNT-1, DSM_APP_MAX + DSM_DEVICE_MAX-2);

    /* Send with wrong address. */
    send_msg(opcode, data, sizeof(data), ADDRESS_COUNT-2, DSM_APP_MAX + DSM_DEVICE_MAX-1);

    /* Remove key. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_unbind(0, DSM_APP_MAX + DSM_DEVICE_MAX-1));
    send_msg(opcode, data, sizeof(data), ADDRESS_COUNT-1, DSM_APP_MAX + DSM_DEVICE_MAX-1);

    /* Add key back in, but remove address. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_application_bind(0, DSM_APP_MAX + DSM_DEVICE_MAX-1));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_remove(0, ADDRESS_COUNT-1));
    send_msg(opcode, data, sizeof(data), ADDRESS_COUNT-1, DSM_APP_MAX + DSM_DEVICE_MAX-1);
}

void test_settergetter(void)
{
    dsm_handle_t address_handle = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_set(0, address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_address_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_get(ACCESS_MODEL_COUNT, &address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_get(0, &address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_address_get(0, &address_handle));

    uint8_t ttl = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_ttl_set(0, ttl));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_ttl_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_ttl_get(ACCESS_MODEL_COUNT, &ttl));

    access_publish_resolution_t resolution = (access_publish_resolution_t) 0;
    uint8_t step_number = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_set(0, resolution, step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_period_get(0, NULL, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_period_get(0, &resolution, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_period_get(0, NULL, &step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_get(ACCESS_MODEL_COUNT, &resolution, &step_number));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_period_get(0, &resolution, &step_number));

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_add(0, address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_remove(0, address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_list_alloc(0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscription_lists_share(0, 1));

    dsm_handle_t addresses[DSM_ADDR_MAX];
    uint16_t size = DSM_ADDR_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_subscriptions_get(0, NULL, &size));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_subscriptions_get(0, addresses, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_subscriptions_get(0, addresses, &size));

    dsm_handle_t applications[DSM_APP_MAX + DSM_DEVICE_MAX] = {0};
    size = DSM_APP_MAX + DSM_DEVICE_MAX;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_bind(0, applications[0]));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_application_unbind(0, applications[0]));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_applications_get(0, NULL, &size));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_applications_get(0, applications, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_applications_get(0, applications, &size));

    dsm_handle_t appkey_handle = 0;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_set(0, appkey_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_publish_application_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_publish_application_get(0, &appkey_handle));

    access_model_id_t model_id = {TEST_MODEL_ID, ACCESS_COMPANY_ID_NONE};
    access_model_handle_t handle;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_handle_get(0, model_id, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_handle_get(0, model_id, &handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_handle_get(ACCESS_ELEMENT_COUNT, model_id, &handle));

    size = 0;
    access_model_handle_t models[ACCESS_MODEL_COUNT];
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_element_models_get(0, NULL, &size));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_element_models_get(0, models, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, access_element_models_get(0, models, &size));
    size = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_models_get(ACCESS_ELEMENT_COUNT, models, &size));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, models, &size));
    TEST_ASSERT_EQUAL(0, size); /* No models added yet. */

    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_model_id_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_id_get(ACCESS_MODEL_COUNT, &model_id));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_model_id_get(0, &model_id));

    uint8_t model_count;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_element_vendor_model_count_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_vendor_model_count_get(ACCESS_ELEMENT_COUNT, &model_count));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, &model_count));
    TEST_ASSERT_EQUAL(0, model_count);

    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, access_element_sig_model_count_get(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, access_element_sig_model_count_get(ACCESS_ELEMENT_COUNT, &model_count));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_sig_model_count_get(0, &model_count));
    TEST_ASSERT_EQUAL(0, model_count);

