NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    /* Updating model info (subscribe/puiblish information) without actually changing any value should not cause flash operations */
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        update_test_model(&test_vector[i], model_handle[i], false);
    }
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    /*  Using a new ttl value for the first model will initiate a flash operation for the whole model, but not other models */
    test_vector[0].publish_ttl = 50;
    update_test_model(&test_vector[0], model_handle[0], false);
    p_model_flash_entry[0] = expect_flash_manager_entry(FLASH_GROUP_MODEL | model_handle[0], sizeof(access_model_state_data_t));
    for (uint32_t i = 1; i < test_vector_size; ++i)
    {
        update_test_model(&test_vector[i], model_handle[i], false);
    }

    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();

    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        access_model_state_data_t * p_model_data = (access_model_state_data_t *) p_model_flash_entry[i]->data;
        verify_flash_modeldata(&test_vector[i], p_model_data, 0);
    }

    /* Add a new model to element 1 and allocate a new subscription list for it. */
    access_flash_test_struct_t new_test_case =
        FLASH_TEST_VECTOR_INSTANCE(model_id1, 1, &addresses[0], sizeof_addresses, UINT32_MAX,
                                   0xA, pub_period1, &appkeys[0], 3, 0x1, 4); /*lint !e64 Type mismatch. */
    access_model_handle_t new_test_case_model_handle = init_test_model_and_subs_list(&new_test_case);
    update_test_model(&new_test_case, new_test_case_model_handle, true);
    p_subs_flash_entry[1] = expect_flash_manager_entry(FLASH_GROUP_SUBS_LIST | 1, sizeof(access_flash_subscription_list_t));
    p_model_flash_entry[test_vector_size] = expect_flash_manager_entry(FLASH_GROUP_MODEL | new_test_case_model_handle, sizeof(access_model_state_data_t));
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        update_test_model(&test_vector[i], model_handle[i], false);
    }
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    verify_flash_modeldata(&new_test_case, (access_model_state_data_t *) p_model_flash_entry[test_vector_size]->data, 1);
    access_flash_subscription_list_t * p_subs_list2 = (access_flash_subscription_list_t *) p_subs_flash_entry[1]->data;
    TEST_ASSERT_EQUAL_UINT32_ARRAY(address_bitfield, p_subs_list2->inverted_bitfield, BITFIELD_BLOCK_COUNT(DSM_ADDR_MAX));

    /* Verify that reading from access will produce the values given by the test vectors. */
    verify_test_case_and_access_state(&new_test_case, new_test_case_model_handle);
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        verify_test_case_and_access_state(&test_vector[i], model_handle[i]);
    }

    /********************************* Reset access and lose all data:*****************************/
    access_publish_init_Expect();
    access_reliable_init_Expect();
    access_init();
    /* Check that elements are un populated */
    access_model_handle_t model_handles[ACCESS_MODEL_COUNT];
    uint16_t models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);

    /* If there is nothing stored, and the flash_manager returns a null for metadata we expect nothing to happen: */
    flash_manager_entry_get_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, NULL);
    TEST_ASSERT_FALSE(access_flash_config_load());


    /********************************* Restore access state from flash:*****************************/
    /* First read the metadata*/
    flash_manager_entry_get_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, p_metadata_flash_entry);
    /* Metadata is sane so subscriptionlist, elements, and models should be restored */
    fm_handle_filter_t subs_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_SUBS_LIST};
    restore_flash(&subs_filter, p_subs_flash_entry, 2);

    fm_handle_filter_t elem_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_ELEMENT};
    restore_flash(&elem_filter, &p_element_flash_entry, 1);
    fm_handle_filter_t model_filter = {.mask = FLASH_HANDLE_FILTER_MASK, .match = FLASH_GROUP_MODEL};
    restore_flash(&model_filter, p_model_flash_entry, 3);
    for (int i = sizeof_addresses-1; i >= 0; --i)
    {
        dsm_address_publish_add_handle_IgnoreAndReturn(NRF_SUCCESS);
        dsm_address_subscription_add_handle_IgnoreAndReturn(NRF_SUCCESS);
    }
    TEST_ASSERT_TRUE(access_flash_config_load());

    /* Even though we have successfully loaded all the flash data, the elements are still  unpopulated:
     * The user must add the models first. */
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(0, models_count);


    /*  Add models to revive them. */
    access_model_handle_t restored_model_handle;
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
       TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&test_vector[i].add_params, &restored_model_handle));
       TEST_ASSERT_EQUAL(model_handle[i],  restored_model_handle);
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&new_test_case.add_params, &restored_model_handle));

    TEST_ASSERT_EQUAL(new_test_case_model_handle,  restored_model_handle);
    /* Verify that reading from access will produce the values given by the test vectors. */
    verify_test_case_and_access_state(&new_test_case, new_test_case_model_handle);
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        verify_test_case_and_access_state(&test_vector[i], model_handle[i]);
    }

    /* Allocation  subscription list should not affect anything and the user should simply get a success: */
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(model_handle[i]));
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_subscription_list_alloc(new_test_case_model_handle));
    /* Verify that reading from access will produce the values given by the test vectors. */
    verify_test_case_and_access_state(&new_test_case, new_test_case_model_handle);
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        verify_test_case_and_access_state(&test_vector[i], model_handle[i]);
    }

    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(2, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(2, models_count);

