NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    uint16_t location = 0xFF;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(0, &location));
    TEST_ASSERT_EQUAL(location_element1, location);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(1, &location));
    TEST_ASSERT_EQUAL(location_element2, location);

    /* Adding models before a restore is also accepted. */
    access_publish_init_Expect();
    access_reliable_init_Expect();
    access_init();
    /* Add models first before restore*/
    access_model_handle_t reinit_handle;
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
       TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&test_vector[i].add_params, &reinit_handle));
    }
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_model_add(&new_test_case.add_params, &reinit_handle));

    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(2, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(2, models_count);

    /* First read the metadata */
    flash_manager_entry_get_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, p_metadata_flash_entry);
    restore_flash(&subs_filter, p_subs_flash_entry, 2);
    restore_flash(&elem_filter, &p_element_flash_entry, 1);
    restore_flash(&model_filter, p_model_flash_entry, 3);
    TEST_ASSERT_TRUE(access_flash_config_load());

    /* Verify that reading from access will produce the values given by the test vectors. */
    verify_test_case_and_access_state(&new_test_case, new_test_case_model_handle);
    for (uint32_t i = 0; i < test_vector_size; ++i)
    {
        verify_test_case_and_access_state(&test_vector[i], model_handle[i]);
    }

    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(0, model_handles, &models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(0, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(1, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_models_get(1, model_handles, &models_count));
    TEST_ASSERT_EQUAL(2, models_count);
    models_count = ACCESS_MODEL_COUNT;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_vendor_model_count_get(1, (uint8_t *)&models_count));
    TEST_ASSERT_EQUAL(2, models_count);

    location = 0xFF;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(0, &location));
    TEST_ASSERT_EQUAL(location_element1, location);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, access_element_location_get(1, &location));
    TEST_ASSERT_EQUAL(location_element2, location);


    /**************************************** Flash erase *****************************************/
    /* Try a direct call to access_clear */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    access_reliable_cancel_all_Expect();
    access_clear();

    /* Return unexpected metadata from flash, this should trigger wipe */
    p_metadata = (access_flash_metadata_t *) p_metadata_flash_entry->data;
    p_metadata->model_count--;
    flash_manager_entry_get_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, p_metadata_flash_entry);
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    TEST_ASSERT_FALSE(access_flash_config_load());

    /************************************** Flash callbacks ***************************************/
    /* A call back about the removal of the flash manager should cause it to be added again. */
    uint32_t expected_add_calls = m_flash_manager_calls + 1;
    /** Expect the metadata to be written since we have erased the flash in earlier tests. (fail this attempt) */
    m_flash_manager_config.remove_complete_cb(mp_flash_manager);
    TEST_ASSERT_EQUAL(expected_add_calls, m_flash_manager_calls);

    /* Test the write complete callback all are ignored except flash malfunction */
    m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_SUCCESS);
    nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_FLASH_FAILED,
            .params.flash_failed.user = NRF_MESH_FLASH_USER_ACCESS,
            .params.flash_failed.p_flash_entry = p_metadata_flash_entry,
            .params.flash_failed.p_flash_page = NULL,
            .params.flash_failed.p_area = mp_flash_manager->config.p_area,
            .params.flash_failed.page_count = mp_flash_manager->config.page_count,
        };
    event_handle_Expect(&evt);
    m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_FLASH_MALFUNCTION);
    TEST_NRF_MESH_ASSERT_EXPECT(m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_AREA_FULL));
    TEST_NRF_MESH_ASSERT_EXPECT(m_flash_manager_config.write_complete_cb(mp_flash_manager, p_metadata_flash_entry, FM_RESULT_ERROR_NOT_FOUND));

    /****************************** Retry failed flash operations  ********************************/
    /* Try a store but fail to write the metadata */
    TEST_ASSERT_EQUAL(0, m_listener_register_calls);
    flash_manager_entry_alloc_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t), NULL);
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    /* The failed attempt will trigger a register call. */
    TEST_ASSERT_EQUAL(1, m_listener_register_calls);
    /* test access_clear */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_ERROR_NO_MEM);
    access_reliable_cancel_all_Expect();
    access_clear();
    TEST_ASSERT_EQUAL(2, m_listener_register_calls);

