NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_access.c
    /* A call-back will trigger config_clear again*/
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_ERROR_NO_MEM);
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(3, m_listener_register_calls);

    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(3, m_listener_register_calls);

    /* test config store */
    /* config_store should do nothing since the module is waiting for a remove_complete_cb callback, but it will register with the listener */
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    access_flash_config_store();
    TEST_ASSERT_EQUAL(4, m_listener_register_calls);
    /** Send an erase complete event, we should be able to make config store calls then. */
    m_flash_manager_config.remove_complete_cb(mp_flash_manager);

    flash_manager_entry_alloc_ExpectAndReturn(mp_flash_manager, FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t), NULL);
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_EQUAL(5, m_listener_register_calls);

    /* A call-back will trigger config_store */
    /* Only metadata will be stored since everything else has been cleared*/
    (void) expect_flash_manager_entry(FLASH_HANDLE_METADATA, sizeof(access_flash_metadata_t));
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);

    /* Since we stored everything the callback should do nothing: */
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
    mp_mem_listener->callback(mp_mem_listener->p_args);
}
